In [9]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

import matplotlib.pyplot as plt

names = ["userid","time","bank_id","pre_amount_of_bill","pre_repayment","credit_amount",\
         "amount_of_bill_left","least_repayment","consume_amount","amount_of_bill","adjust_amount",\
         "circ_interest","avail_amount","prepare_amount","repayment_state"]

bill_train = pd.read_csv("../../pcredit/train/bill_detail_train.txt",header=None)
bill_test = pd.read_csv("../../pcredit/test/bill_detail_test.txt",header=None)

bill_train.columns=names
bill_train.head()

,userid,time,bank_id,pre_amount_of_bill,pre_repayment,credit_amount,amount_of_bill_left,least_repayment,consume_amount,amount_of_bill,adjust_amount,circ_interest,avail_amount,prepare_amount,repayment_state
0,3150,5906744363,6,18.626118,18.661937,20.664418,18.905766,17.847133,1,0.0,0.0,0.0,0.0,19.971271,0
1,3150,5906744401,6,18.905766,18.909954,20.664418,19.113305,17.911506,1,0.0,0.0,0.0,0.0,19.971271,0
2,3150,5906744427,6,19.113305,19.150290,20.664418,19.300194,17.977610,1,0.0,0.0,0.0,0.0,19.971271,0
3,3150,5906744515,6,19.300194,19.300280,21.000890,20.303240,18.477177,1,0.0,0.0,0.0,0.0,20.307743,0
4,3150,5906744562,6,20.303240,20.307744,21.000890,20.357134,18.510985,1,0.0,0.0,0.0,0.0,20.307743,0

In [10]:
#  测试数据
bill_test.columns=names
bill_test.head()

,userid,time,bank_id,pre_amount_of_bill,pre_repayment,credit_amount,amount_of_bill_left,least_repayment,consume_amount,amount_of_bill,adjust_amount,circ_interest,avail_amount,prepare_amount,repayment_state
0,57189,0,7,13.938985,0.000000,19.054980,19.041388,16.888236,0,19.035287,0.0,0.0,19.041388,18.361833,0
1,57189,0,16,0.000000,0.000000,19.614596,19.631273,16.921293,2,0.000000,0.0,0.0,0.000000,19.614596,0
2,57189,0,4,0.000000,0.000000,19.971271,19.983385,17.682588,2,0.000000,0.0,0.0,0.000000,0.000000,0
3,57189,0,4,20.195572,18.005158,19.971271,20.182494,17.880566,4,17.881698,0.0,0.0,0.000000,0.000000,0
4,57189,0,3,0.000000,0.000000,20.846739,20.846682,18.679239,0,0.000000,0.0,0.0,0.000000,0.000000,0

In [2]:
bill_users = pd.pivot_table(bill_train,index=['userid'],values=['consume_amount'])
bill_users.head()

        consume_amount
userid
2             2.521739
3             2.000000
4             0.055556
5             0.000000
6             2.904762

In [11]:
bill_test_users = pd.pivot_table(bill_test,index=['userid'],values=['consume_amount'])
bill_test_users.head()

        consume_amount
userid
55597         0.663265
55598         0.285714
55599         1.363636
55600         0.000000
55601         0.000000

In [3]:
bill_users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 53174 entries, 2 to 55596
Data columns (total 1 columns):
consume_amount    53174 non-null float64
dtypes: float64(1)
memory usage: 830.8 KB

In [13]:
bill_test_users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13643 entries, 55597 to 69495
Data columns (total 1 columns):
consume_amount    13643 non-null float64
dtypes: float64(1)
memory usage: 213.2 KB

In [15]:
# 用户id,性别,职业,教育程度,婚姻状态,户口类型
names = ['userid','sex','job','edu','marriage','account']
user_info_train = pd.read_csv("../../pcredit/train/user_info_train.txt",header=None)
user_info_train.columns = names
user_info = pd.pivot_table(user_info_train,index=["userid"],values=names)
user_info.head()  #  bill_detail  数据中 userid == 1 的数据没有

        account  edu  job  marriage  sex
userid
1             3    3    2         1    1
2             1    3    2         2    1
3             4    4    4         1    1
4             2    4    4         3    1
5             1    2    2         3    1

In [16]:
user_info_test = pd.read_csv("../../pcredit/test/user_info_test.txt",header=None)
user_info_test.columns = names
user_test_info = pd.pivot_table(user_info_test,index=["userid"],values=names)
user_test_info.head()  #  bill_detail  数据中 userid == 1 的数据没有

        account  edu  job  marriage  sex
userid
55597         4    3    2         1    2
55598         4    2    2         3    1
55599         1    4    2         2    2
55600         1    4    4         3    2
55601         4    3    2         1    1

In [6]:
user_bill = user_info.join(bill_users)
user_bill.head()

        account  edu  job  marriage  sex  consume_amount
userid
1             3    3    2         1    1             NaN
2             1    3    2         2    1        2.521739
3             4    4    4         1    1        2.000000
4             2    4    4         3    1        0.055556
5             1    2    2         3    1        0.000000

In [8]:
user_bill.shape

(55596, 6)

In [7]:
user_bill[user_bill['consume_amount'].isnull()].shape

(2422, 6)

In [17]:
user_test_bill = user_test_info.join(bill_test_users)
user_test_bill.head()

        account  edu  job  marriage  sex  consume_amount
userid
55597         4    3    2         1    2        0.663265
55598         4    2    2         3    1        0.285714
55599         1    4    2         2    2        1.363636
55600         1    4    4         3    2        0.000000
55601         4    3    2         1    1        0.000000

In [18]:
user_test_info.shape

(13899, 5)

In [19]:
user_test_bill[user_test_bill['consume_amount'].isnull()].shape

(256, 6)